# tips and tricks of pandas

In [ ]:
import pandas as pd
# for version
pd.__version__

'1.5.3'

In [ ]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.8.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 7
Version          : 6.1.7601
machine          : AMD64
processor        : AMD64 Family 16 Model 6 Stepping 3, AuthenticAMD
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.1
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 49.2.1
pip              : 20.2.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : None
IPython          : 8.9.0
pandas_datareader: None
bs4              : None
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.6.3
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.0
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### make a dataframe

In [ ]:
df = pd.DataFrame({'Hassan':[1,2,3,6,4,8,9], 'JawaD':[11,12,34,5,65,752,3]})
print(df)

   Hassan  JawaD
0       1     11
1       2     12
2       3     34
3       6      5
4       4     65
5       8    752
6       9      3

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame(np.random.rand(12,8), columns=list('ABCDEFGH'))
df

,A,B,C,D,E,F,G,H
0,0.900831,0.576211,0.969719,0.892409,0.988415,0.134200,0.311726,0.189942
1,0.456103,0.688742,0.096939,0.731649,0.123673,0.223790,0.008263,0.151856
2,0.218032,0.747406,0.387052,0.033702,0.285051,0.924016,0.132859,0.634726
3,0.678019,0.203893,0.031845,0.540512,0.279493,0.266692,0.956519,0.365595
4,0.430037,0.340889,0.888223,0.973271,0.254435,0.091489,0.750862,0.213684
5,0.868614,0.431913,0.965534,0.174914,0.727590,0.974300,0.831479,0.853457
6,0.023909,0.119360,0.186953,0.786058,0.799448,0.530885,0.050621,0.782209
7,0.033394,0.111622,0.564561,0.034303,0.704206,0.110551,0.807923,0.738697
8,0.346662,0.939163,0.243628,0.125842,0.738635,0.881108,0.473898,0.358962
9,0.547253,0.856884,0.164970,0.081730,0.604862,0.448646,0.026351,0.205756
10,0.560374,0.556807,0.594342,0.530930,0.429402,0.298953,0.397280,0.623188
11,0.640032,0.469781,0.575578,0.312060,0.345231,0.103601,0.772222,0.787144

## renames coluomn

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({'Hassan':[1,2,3,6,4,8,9], 'JawaD':[11,12,34,5,65,752,3]})
print(df)

   Hassan  JawaD
0       1     11
1       2     12
2       3     34
3       6      5
4       4     65
5       8    752
6       9      3

In [ ]:
df.rename(columns={'Hassan':'alpha 1', 'JawaD':'beta 1'}, inplace=True)
df

   alpha 1  beta 1
0        1      11
1        2      12
2        3      34
3        6       5
4        4      65
5        8     752
6        9       3

In [ ]:
df.columns=(['alpha 22', 'beta 22'])
df

   alpha 22  beta 22
0         1       11
1         2       12
2         3       34
3         6        5
4         4       65
5         8      752
6         9        3

# using template data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
kasht=sns.load_dataset('tips')
kasht.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
kasht.describe()

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [ ]:
kasht.to_csv('tips')

In [ ]:
pip install openyxl

Collecting openyxl
  Downloading openyxl-0.1.tar.gz (6.8 kB)
Using legacy 'setup.py install' for openyxl, since package 'wheel' is not installed.
Installing collected packages: openyxl
    Running setup.py install for openyxl: started
    Running setup.py install for openyxl: finished with status 'done'
Successfully installed openyxl-0.1
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.1; however, version 23.0 is available.
You should consider upgrading via the 'c:\Users\Maham COmputers\AppData\Local\Programs\Python\Python38\python.exe -m pip install --upgrade pip' command.

In [ ]:
kasht.to_excel('tips.xlsx')

# reverse rwow

In [ ]:
import seaborn as sns
kasht = sns.load_dataset('titanic')
kasht.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [ ]:
kasht.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# only select data types
kasht.select_dtypes(include=(['numbers']).head()